{
    "id": "train-intro",
    "data": [
        {
            "text": "After catching your breath, you decide to explore the train."
        },
        {
            "text": "Walking through the coaches reveals nothing obviously out of the ordinary. Seats, luggage racks, bathrooms, tables, and so on. The only odd parts are that everything is completely deserted, the windows have heavy metal shutters hanging above them, and that the train is running at all. It's the end of the world; who's operating it?"
        },
        {
            "text": "In one of the cars towards the engine, you do find a collection of old, tarnished items lying haphazardly on a small tray. There's no hint of their former owner or why they might have been left here, but you could take the worn knife, silver medallion, and plastic packet of oddly metallic candies if you wanted.",
            "choice": {
                "text": "Take the items?",
                "responses": {
                    "yes": {
                        "item": [
                            {
                                "action": "add",
                                "id": "old-knife",
                                "number": 1
                            },
                            {
                                "action": "add",
                                "id": "tarnished-medallion",
                                "number": 1
                            },
                            {
                                "action": "add",
                                "id": "golden-gummy-bear",
                                "number": 3
                            }
                        ]
                    },
                    "no": {}
                }
            }
        },
        {
            "text": "Finally making your way to the locked door leading to the locomotive, you find a strange control panel bleeding blue light into the car. It describes your trajectory on a map you don't recognize - heading east, apparently. It appears you can operate track switches from here to change the train's path, but there aren't any on the current route."
        },
        {
            "text": "The next station is listed as DESERT, and seems to stop at a rural town in the aforementioned desert. The map is pretty low-detail, but you can at least make out that the train will stop at a small platform in the village outskirts. It might be a good idea to head into town once you arrive to try and pick up some supplies."
        },
        {
            "text": "Regardless, it's a full day's travel away; you'll be spending most of the day on this train whether you want to or not. Although that's probably a good thing, as the shutters you noticed earlier begin to latch firmly closed against the first light of dawn - blocking out the deadly sun. You should be safe here until you arrive.",
            "action": {
                "time": {
                    "add": "00:08:00"
                }
            },
            "exit": {
                "type": "train",
                "id": "start"
            }
        }
    ]
}
